# Все задачи текущего блока решите с помощью генераторов списков!

# Задание-1:
# Дан список, заполненный произвольными целыми числами. 
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]

arr = [int(i) for i in str(input('Введите целые числа через запятую для заполнения списка: ')).split(',')]
arr1 = [i**2 for i in arr]
print(arr1)

# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.

fruit_list1 = [i.strip() for i in str(input('Введите названия фруктов через запятую без пробелов для заполнения списка 1: ')).split(',')]
fruit_list2 = [i.strip() for i in str(input('Введите названия фруктов через запятую без пробелов для заполнения списка 2: ')).split(',')]
fruit_list3 = list(set(arr1) & set(arr2))
print('Список фруктов, которые присутствуют в 1-м и 2-м списке: ', fruit_list3)

# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4

arr = [int(i) for i in str(input('Введите целые числа через запятую для заполнения списка: ')).split(',')]
arr1 = [int(i) for i in arr if i >= 0 and i % 3 == 0 and i % 4 != 0]
print('Список из исходного, удовлетворяющий указанным условиям: ', arr1)
