# Задача-1:
# Напишите небольшую консольную утилиту,
# позволяющую работать с папками текущей директории.
# Утилита должна иметь меню выбора действия, в котором будут пункты:
# 1. Перейти в папку
# 2. Просмотреть содержимое текущей папки
# 3. Удалить папку
# 4. Создать папку
# При выборе пунктов 1, 3, 4 программа запрашивает название папки
# и выводит результат действия: "Успешно создано/удалено/перешел",
# "Невозможно создать/удалить/перейти"

# Для решения данной задачи используйте алгоритмы из задания easy,
# оформленные в виде соответствующих функций,
# и импортированные в данный файл из easy.py

# К сожалению, не разобрался, как в github вставлять сторонние файлы модулей. Поэтому пишу сюда. Название les05_easy_norm.py
# Нет прямой ссылки из easy, так как задачи easy поставлены иначе, чем в normal.
def goto_path():
    try:
        import os
        path = input('Введите путь папки для изменения рабочей директории: ')
        os.chdir(path)
        print('Успешно изменили путь папки на: ', os.getcwd())
        print('Нажмите ввод для продолжения')
        input()
    except FileNotFoundError as e:
        print('Указано неверное имя файла. Проверьте правильность написания')
        print('Нажмите ввод для продолжения')
        input()
    except Exception as e:
        print('Какие-то Ваши действия привели к ошибке')

def current_dir():
    import os
    print('Текущая директория: ', os.getcwd())
    print('Нажмите ввод для продолжения')
    input()

def remove_dir():
    import os
    try:
        user_dir_del = input('Введите название папки в рабочей директории, которую вы хотите удалить: ')
        os.rmdir(user_dir_del)
        print('Папка {} успешно удалена'.format(user_dir_del))
        print('Нажмите ввод для продолжения')
        input()
    except FileNotFoundError as e:
        print('Указано неверное имя файла. Проверьте правильность написания')
        print('Нажмите ввод для продолжения')
        input()
    except PermissionError as e:
        print('Недостаточно прав доступа к папке. Попробуйте расширить права доступа')
        print('Нажмите ввод для продолжения')
        input()
    except Exception as e:
        print('Какие-то Ваши действия привели к ошибке')
        print('Нажмите ввод для продолжения')
        input()

def create_dir():
    import os
    try:
        user_dir_create = input('Введите название папки для создания ее в рабочей директории: ')
        os.mkdir(user_dir_create)
        print('Папка {} успешно создана'.format(user_dir_create)) 
        print('Нажмите ввод для продолжения')
        input()
    except OSError as e:
        print(r'Синтаксическая ошибка в имени директории. Не используйте символы \/:*?<>|')
        print('Нажмите ввод для продолжения')
        input()
    except Exception as e:
        print('Какие-то Ваши действия привели к ошибке')
        print('Нажмите ввод для продолжения')
        input()
