# Задание-1: уравнение прямой вида y = kx + b задано в виде строки.
# Определить координату y точки с заданной координатой x.

equation = 'y = -12x + 11111140.2121'
x = 2.5
# вычислите и выведите y


# вычленить из строки x и b, взять у них значение и вставить в формулу.
# не забыть про float.
# данный способ не предусматривает проверки. Тогда либо код будет трудночитаемый, либо придется вводить дополнительные переменные.
arr = input('Введите уравнение типа y = kx + b: ')
x = float(input('Введите значение x: '))
print('Решение уравнения: y = {k}x + {b}. При x = {x} y = {y}'.format(k=float(arr[arr.index('=')+1:arr.index('x')]), \
                                                                          b=float(arr[arr.index('+')+1:]), \
                                                                          x=x, \
                                                                          y=float(float(arr[arr.index('=')+1:arr.index('x')])* x + float(arr[arr.index('+')+1:]))))
input('Нажмите ввод для продолжения')

# Задание-2: Дата задана в виде строки формата 'dd.mm.yyyy'.
# Проверить, корректно ли введена дата.
# Условия корректности:
# 1. День должен приводиться к целому числу в диапазоне от 1 до 30(31)
#  (в зависимости от месяца, февраль не учитываем)
# 2. Месяц должен приводиться к целому числу в диапазоне от 1 до 12
# 3. Год должен приводиться к целому положительному числу в диапазоне от 1 до 9999
# 4. Длина исходной строки для частей должна быть в соответствии с форматом 
#  (т.е. 2 символа для дня, 2 - для месяца, 4 - для года)

# Пример корректной даты
date = '01.11.1985'

# Примеры некорректных дат
date = '01.22.1001'
date = '1.12.1001'
date = '-2.10.3001'

date = input('Введите дату в формате: dd.mm.yyyy: ').split('.')
print('Введенная дата: {day} {month} {year} года'.format(day=int(date[0]) if int(date[0]) in range(1, 32) else 'WrongDay',\
                                                             month=date[1] if int(date[1]) in range(1, 13) else 'WrongMonth', \
                                                             year=date[2] if (int(date[2]) > 1) or (int(date[2]) < 9999) else 'WrongYear'))
input('Нажмите ввод для продолжение')


# Задание-3: "Перевёрнутая башня" (Задача олимпиадного уровня)
#
# Вавилонцы решили построить удивительную башню —
# расширяющуюся к верху и содержащую бесконечное число этажей и комнат.
# Она устроена следующим образом — на первом этаже одна комната,
# затем идет два этажа, на каждом из которых по две комнаты, 
# затем идёт три этажа, на каждом из которых по три комнаты и так далее:
#         ...
#     12  13  14
#     9   10  11
#     6   7   8
#       4   5
#       2   3
#         1
#
# Эту башню решили оборудовать лифтом --- и вот задача:
# нужно научиться по номеру комнаты определять,
# на каком этаже она находится и какая она по счету слева на этом этаже.
#
# Входные данные: В первой строчке задан номер комнаты N, 1 ≤ N ≤ 2 000 000 000.
#
# Выходные данные:  Два целых числа — номер этажа и порядковый номер слева на этаже.
#
# Пример:
# Вход: 13
# Выход: 6 2
#
# Вход: 11
# Выход: 5 3
