# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

print('Дан список фруктов. Напишите программу, \
выводящую фрукты в виде нумерованного списка, выровненного \
по правой стороне')
arr_fruit = ['яблоко', 'банан', 'киви', 'арбуз']
print('Дано: {0}'.format(arr_fruit))
print('Вывод:\n1.{0:>10}\n2.{1:>10}\n3.{2:>10}\n4.{3:>10}'.format(arr_fruit[0], arr_fruit[1], arr_fruit[2], arr_fruit[3]))
print('А теперь через цикл')
input('Нажмите Enter для продолжения')
print('Вывод:')
for i in range(len(arr_fruit)):
    print('{number}.{fruit:>10}'.format(number=(i+1), fruit=arr_fruit[i]))
input('Нажмите ввод для продолжения')


# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.

print('Даны два произвольных списка. Удалите из первого элементы, \
присутствующие во втором списке')
arr1 = list(input('Введите последовательность символов без пробелов \
для заполнения списка № 1: '))
arr2 = list(input('Введите последовательность символов без пробелов \
для заполнения списка № 2: '))
print('Список № 1: ', arr1)
print('Список № 2: ', arr2)
print('Результат удаления из первого списка элементов второго списка: {arr3}'.format(arr3=[i for i in arr1 if i not in arr2]))
input('Нажмите ввод для продолжения')

# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.

print('Дан произвольный список из целых чисел. \
Получите НОВЫЙ список из элементов исходного, выполнив \
следующие условия: если элемент кратен двум, то разделить его \
на 4, если не кратен, то умножить на 2')
arr = [int(i) for i in str(input('Введите целые числа через пробел, \
чтобы заполнить список: ')).split(' ')]
# поскольку надо делить на 2, переводим int в float
arr1 = [float(i)/4 for i in arr if int(i) % 2 == 0] + [float(i)*2 for i in arr if int(i) % 2 != 0]
print('Новый список: ', arr1)
input('Нажмите ввод для продолжения')
