
__author__ = 'VEdlin'

# Задача-1: Дано произвольное целое число, вывести самую большую цифру этого числа.
# Например, дается x = 58375.
# Нужно вывести максимальную цифру в данном числе, т.е. 8.
# Подразумевается, что мы не знаем это число заранее.
# Число приходит в виде целого беззнакового.
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании и понимании решите задачу с применением цикла for.
print('task 1: Дано произвольное число, вывести саму большую цифру')
y = int(input('Введите произвольное целое число: '))
print('Проверка варианта через max(str(x))')
print('Если вы видите максимальное число, значит все получилось: ' + (max(str(y))))
print('Теперь через цикл')
z = 0
for i in str(y):
    if int(i) > z:
        z = int(i)
    else:
        continue
print('Максимальное число, полученное с помощью цикла: ', z)


# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;
# * при желании и понимании воспользуйтесь синтаксисом кортежей Python.

print('task 2: Поменять значения местами через действия над числами')
c1 = int(input('Введите первое число c: '))
d1 = int(input('Введите второе число d: '))
print('Значения переменных до изменения: c = {0}, d = {1}'.format(c1, d1))
c1, d1 = d1, c1
print('Меняем значения местами: c = {c_new}, d = {d_new}'.format(c_new = c1, d_new = d1))

# Задача-3: Напишите программу, вычисляющую корни квадратного уравнения вида
# ax² + bx + c = 0.
# Коэффициенты уравнения вводятся пользователем.
# Для вычисления квадратного корня воспользуйтесь функцией sqrt() модуля math:
# import math
# math.sqrt(4) - вычисляет корень числа 4
print('task 3: Вычисление корней квадратного уравнения типа ax*2 + bx + c = 0')
a = int(input('Введите коэффициент a: '))
b = int(input('Введите коэффициент b: '))
c = int(input('Введите коэффициент c: '))
D = b*b - 4*a*c
if D >= 0:
    x1 = (-b + int(math.sqrt(D))) / (2*a)
    x2 = (-b - int(math.sqrt(D))) / (2*a)
    result = 'Дискриминант равен: {discr}, X1 = {x1}, X2 = {x2}'.format(discr = D, x1 = x1, x2 = x2)
else:
    result = 'Дискриминант равен: {discr}. В таком случае нет решений уравнения'.format(discr = D)
return result
