
__author__ = 'Ваши Ф.И.О.'

# Задача-1: Дано произвольное целое число (число заранее неизвестно).
# Вывести поочередно цифры исходного числа (порядок вывода цифр неважен).
# Подсказки:
# * постарайтесь решить задачу с применением арифметики и цикла while;
# * при желании решите задачу с применением цикла for.

# код пишем тут...
print('task 1: Вывести поочередно цифры исходного числа')
b = input('Введите произвольное целое число: ')
# вариантов много, но здесь сначала преобразуем int в str,
# т.к. int не итерируемый тип. Затем проходим циклом.
for _ in str(b): print(_)

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Подсказка:
# * постарайтесь сделать решение через дополнительную переменную 
#   или через арифметические действия
# Не нужно решать задачу так:
# print("a = ", b, "b = ", a) - это неправильное решение!
print('task 2: Поменять значения переменных местами')
c = int(input('Введите первое число c: '))
d = int(input('Введите второе число d: '))
print('Значения переменных до изменения: c = {0}, d = {1}'.format(c, d))
temp = d
d = c
c = temp
del temp
print('Меняем значения местами: c = {c_new}, d = {d_new}'.format(c_new = c, d_new = d))


# Задача-3: Запросите у пользователя его возраст.
# Если ему есть 18 лет, выведите: "Доступ разрешен",
# иначе "Извините, пользование данным ресурсом только с 18 лет"
print('task 3: Запросить у пользователя возраст')
x = int(input('Введите возраст (целое число): '))
if x >= 18:
    print('Доступ разрешен')
else:
    print('Извините, пользование данным ресурсом только с 18 лет')
